# Отчёт о тестировании приложения "Money Transfer"

## Краткое описание

30.09.2021 было проведено тестирование приложения "Money Transfer".

На тестирование затрачено: 2 часа.

В результате тестирования выявлены следующие дефекты:
https://github.com/ETarkhanova/Money-Transfer/issues/1

## Описание процесса тестирования

В процессе тестирования использовались следующие артефакты:
* приложение "IntelliJ IDEA"

В качестве тестовых данных использовались данные https://github.com/netology-code/javaqa-homeworks/blob/master/intro/MERGED.md:
* Входные данные задачи, в результате успешного выполения которой, счет клиента пополнился бы на нужную сумму:

    ``текущий баланс счёта клиента - переменная типа int, значение - 2_000_000_000 (два миллиарда рублей)
      сумма перевода - переменная типа int, значение - 500_000_000 (пятьсот миллионов рублей)
    переменная для хранения итогового значения - тип int``

* Код программы:
```public class Main {
  public static void main(String[] args) {
    int price = 150;
    int count = 5;
    int total = price * count;
    System.out.println(total);
  }
}
```

Тестирование производилось в следующем окружении:
* Windows 10, 64-разрядная ОС
* Java 11
